#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "ac4b2abb723ab72f535ede8f1c5bd5d5" -> "1f95e10d1e559fe0aaef52ff4ae47e4b"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "585873901048e8eca056432e4762a0ac" -> "b54837d83dfe06fc587040d048272309"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "92588225fcff1c5ff79d23d5a2946b51" -> "e292a4006f56d4f1b16556a699ca9ffc"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "4be46d96cea952cfe7d118aedb9dae5e" -> "7a72a825baf0e76f1777e77922c023e5"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "9707ee46fc21bb9926d241a331ba0e66" -> "1e377c2f0bf7bf56c46461a312c753b3"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "671a356df8d88e9cc3e95c85ea4eccd4" -> "35827200c40ba94d132a24a21a200904"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "f16a547fb7cfd0c6d786413218e8f0d8" -> "8fec653398509527a77eb72c7a6cb8ad"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "31fa5fbf40e7a10f20800a9ac4eab88b" -> "2e06e875a53293a43c3584fe886c73c5"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "9fc5db06c260c05f538ba735a0b737ad" -> "62bce5685f2aae5afa80bb5bc020e71b"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "97d420ed99eea1bdb82667f80e5f155e" -> "001f87a59dee764034d95d85ee897f81"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "fbbae2b0b0d37a5d97efb09b2cac50c0" -> "a53ac51dea202ab39049bebb39c8a1b1"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "54d5a79e764c795a7a760e0ff1450f75" -> "bff46c07c9c14d3773d1f411a57c9635"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "5ca413ac4705f08d1614d7b308c27bfe" -> "a80202379ef4c0bae2672914c035a7cc"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "625ea43dc6e336ff6030b3c1ef2f82b9" -> "5aba7f15ad1ccc4c21155031411d3db1"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "2b14233e040c9b8b354d404265a369f4" -> "a12503f30900c1f5bb3d47b69ac26ef9"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "2610dd4af196db808d1e51e0f93f319a" -> "9ded2f24a67ff6a3b5e0c0757cff8804"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "c5faf30f66dd04dee437d39bd9c84459" -> "ec35fe73460d5a982c181a5f4d0b70dd"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "76e60b0d3b82a1d911a978c34d577f73" -> "e45db1daa20d70a98d184e4e990691e4"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "c432c55ddb67ad137a146edc38544c4f" -> "0df5b3297fda5a750cee7ffad5cc9183"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "36e9f2385cf7d1638d2bd452bbc9171e" -> "da0c0fb531bcaa8390f4d365f95ea1a9"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "ebaa0edc7b93a1224773931d9945be75" -> "3300714600e7bffb4f69cbf4cb268c12"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "678693457407fc4a51283f55c4b16f3b" -> "e533adbba8a65f81826376ad0ef1a268"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "2ea9005f06ac19d0420fd9d7ab1c6064" -> "16e83f6e1c0ec127099ad84703fb4e24"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "8f99d0ac752a42b213658a77c01c906a" -> "7217c691d8c71e53854c345f0d752e52"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "557f368e215f94477d0dd7884ef6679d" -> "28c202a107a40bfac026974c2b21329c"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "a2e3c2bbfef4eabe2bee4c661f872436" -> "e6090e4aac9b662b486d8afb1c2f8942"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "c5a456b51bfcbf2d9a943945b75b2ba4" -> "6590465a156160f49c6b332bcea8b068"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "a63d65b9707fa1c21090a50ad64c07cb" -> "0da96f0bb331375aab3a6ddbbd9e9124"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "efd692f6306f21315f79d6d9253b047e" -> "a65c3484ea184f3e3ea32e3f525b9aca"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "afb1095292b79d73e1b8ecdbe34e7724" -> "279c98d1d9ca2b63bbf439b5a48ed676"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "fdf3b1686def398f1245d6fe4cad6578" -> "9fccf37a895b59081e180d360d8aa149"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "d1e5a6d6c68da177ab2d990e6243fc42" -> "c40da2e1b233d98ec1f4056c5c53bc02"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "c1ee7772495cb36252f314d1e9e90bab" -> "c5a41a3500f5076581c36bf7ff60d778"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "3199c47acd0750c23c7fe8b99ff4f1de" -> "a378a3067c8f942ca05b710841b7b6dd"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "d7d37969f8c15354abbfbee6a5b7d301" -> "8b476f369f44f60e076568186b3bddf7"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "99cbc369ab13fb5a3f4466d67b67102c" -> "b39569977bb18214ce0709dd71f74c28"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "562cf0f96a8404074f37605dd264b971" -> "0e6630e040bbe78beffdeb1a4f641cc5"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "47c1aad962dfad38aafd358d1bed8d36" -> "c7e30ba22a9a4861a07f2b0c62c0950b"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "31ac08962e32cb93a8ac46ac4bbefed5" -> "4fcd944ef272d13b7aad4ad2a6c99aee"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "16d7415d9ea8ea6a530fbacf017158d4" -> "b01d371fe6ee37f3c55227be29daeba3"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "1f6f53608b5e8360996549e2ca833d5b" -> "54040759b6d9482d4a0b1e5979b11021"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "f6ebb04ba71bfa05e99db597f7f35dce" -> "6b8b1aecfea2122e052c8ff0ea4400c7"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "68dcd24df45146e72ca1d6475578e2f0" -> "780c560d89ff76f97411efc5df10edd4"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "e2d62d88cadee65c4283e850c5b46c33" -> "b87585b835a30bd24e92647c3020c5ef"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "3a083492222006e4f55b4087699b3ce5" -> "ae1315200ea2319f79e92eac44bc52ed"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "753c120094b474f0a03dc25d11fc21d9" -> "6d689de7bd12db02e3f46a591892866a"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "21e9e079d29c40f99a5bec17e44e0ec0" -> "7864f4179adcdde1eae7730b08d4bfd2"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "iVNNSLOxWVd6mEC5OjyoKoHSPZy/8y6aLCvovF97XZk=" -> "otgPly7AzLoUwZ1+Z5SWARq+tJ26bFllfOvP90+DEE0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "3R5aF5apov/KMPkKvF4KjE47PnEZS15SBXPBLJ3601s=" -> "Fh0Ow8A48GK8GU5W7WP5T837hVF71/Jr+OME4t/pV3g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ig8J++YgGYTjkUsYdqw3X+tLw0VZeNpeAC+8cXOH5+Y=" -> "7Rs7zU1N1MknVxXnMy8T9s1/lMUnvC3CWTR9OY0qFPM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "KGXlObntO0M0DrRiVRXEiQDk3preAJZ9FBy5G9bqfHA=" -> "/KjZ44un+oHIgRyubNfxEM6ffOMk2eXsbqsYp3zqBcM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "hkUvSuQH7TWJrzzQxuPYgjMWd/o2IHkvJaeeTK3JDe4=" -> "vHwotyJVwHkjuFxDdzl6Y6P22LDx5RFgrFOaFJ+ehdc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "jKjCvqotw45iOrm3CWIPB2wwcNYy9xEXgEj171qSOm4=" -> "7aJfsA2KRdF5R6HDi19WrA5vVxc5wYxb1z4ELue/pdw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "hkia15+LqO1RbhCg/on6CDXDHbnYQhOCtV8/UocyKFQ=" -> "ac7tHelcrYUc27HcuhFHR8S/jqcDaNTHV4DAOkMTIGA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "RyvXF6t2FHWhiioqeoTM5v+JIz8q7KbUcvFkc2w+oN4=" -> "GXAlvU2hlibmHOYFFMtokL5mBl4sEqAc4uHT8+qzsGo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "/ICE2zCk7VmpPsKdR4oMJhpFLT+fUogHHlChzwirgok=" -> "ZXzbMHR20+cG9N4aFCXePvnPf7D+91LK/YQrERM5eg8="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "j3fuCJktX9pArTBm3e/xrmBVjzQVV5lp5sKzaEZQ1SQ=" -> "z0oGSWHpX4aY8HqN8kqQouw5UJOP9ycEyWLUXVrEOcI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "IhhmSqxoun0ZIvM/HaH9uU97ZozwWca36nhQMFRPhSY=" -> "+OnsfRSYSQJlgB714HH++A+ReQ3qoqYmWzDT3O4rqxY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "xt71eJASBtr/vUDOln3kKKspqAjDN9Z/GRRJvjusrMY=" -> "ykSxR2aAc7CuVZJLgfBJvKVqCZV8JjP5iNP3zNR8NSQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "1K8m92T6V+NIiIr+9PpJb6XyGQrvfiMEWc/gSVovPvI=" -> "Jm6om6sbY/94E0SUVZEKA4VkaKgZ45jd9PtceDal2k0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "gWGlx28DJNuhG+wQANT5SGDScvOi44aVX5tcrsJtlYY=" -> "z3qxiw3wwFqT/DL7+2YakZwq0b8bVmCU5CBLMwx2kOA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "Tn0pyqdeSZpWlxiEUhI0AMALaq3P38gKx/pG+xWQL8E=" -> "LnLxiCYf8K/jz+/sU0JT8v9JTOEAsUrAKtQ+FTISPfk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "E8x7kFsLwyj/aq8buZLg00ba1ogm/EKExhOIClOuOxI=" -> "Z2Cu/YViBl390mDukxC2V7phjKKy7VQR/vA3JIqikew="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "RFMIxJOgjpLSKzCuz/k8m1XpWAtI87OsFrTbViUabQk=" -> "4Uej5fw8UoVn9SVoNdvW6UH4aB2nTiTPAePebvjzw2s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "p0RHyJNlR9H+bGo5J6A7x738yddNj0k7xFsSMmmzGWI=" -> "V+nUIxksa0sMVHNpRjcfQusQEJJXBKbRQGl7D8XbEs4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "9wT+h069AFeHKctAvk7icQBNdJMbyb48Q042PUXsoBQ=" -> "Bb25Oj5vNupWKlNP6hxyZb9ekXBCsZ5DgN1IA+WhIfU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "AdLSHVMKly0/+xl1ZRy4DV97qCAEmQuzn6rVENNVwBM=" -> "muI5aUr5jQab+YFOpvKTiWcE6zhUXzO44I9Ih0q4VIw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "kp5CIiTJ7RYQgBa3tACMfzSFLx7Ym759x5mmQIKLjyk=" -> "yhs974Iqhzf19o0/N4nkxtP2LZGdRgtPsRJL7zjF/Oo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "CyZKfrGVNHp8PLGcmmOTtUA8GO6COib9CAUyaMPB1Mg=" -> "w5gRKkj6FwSdvHygilXcTQKDtcJvQYomInuehohoc/Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "iNLxXSjVXteFsEn4LXmQxE1Zv3LMWUQncQf62XH46Qk=" -> "8GOD1ozALXtD2gbilP00bTzJ+JrT+c2qavTFMjdHY7M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "lpxGXEtO2cvnRSIhARUUJgfGGG9AbmUmt5pqK6+zc8w=" -> "S8hd/vGw8O7aiSGx1FVbpPf0hPoglcTt/WF5te0ytk0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "jLjynT1iv9ihb2pg6b6pZJ/VOSdS2F1HC0hWSdSvS3A=" -> "+iLLG54l8OF6lMoMPfnn6GBIfmObM80FRBYdA4KghoQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "oyqTAGw819xVNXUq1WQrJ72rIVkszSLrtvw0qqcwcB0=" -> "6y3Zr1IhWO//3QA/q9bcG+jb64KKFj5IXbmieOLR6vY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "EM+UQz/KBq1k/6k4zESTfVKGCgRwcDEGxKH3e/RACC0=" -> "HgOnjZw+UfRU01SCYIVwt4s2pxaE9c87v+7zGxwlHGU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "34nO9oFSGwi1oiiZfCYoyX+juhOBRO7SxqkaVkj4QEU=" -> "+/3mva91jgzSD9KWipNh4Jl8b345kY5EqDH2T5v3VKQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "yLxnaAKf8nba81TyYuw5640+zdyn+UbJG6R5cCjFGNQ=" -> "wxi36j8V8mWgQ1m3V+HLZ3TafxbMe3JTYt8T0Atj/aM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "SG0QxdGpwLkgq1nbHS7tW4HsU2vKHa7GKwDLsWzz/Uo=" -> "BcZmbrtMpNX6UdZ4561Gk/r9QtPrIKrrzg95LucdiZ8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "J36BfuryGHmOHJLfT405FwaeaKoJP0Q9CH4PqJuI8cs=" -> "ApMTHFZ+DbhZ5NGwkQNIf7RjFMnH8Cs/yQoB/RRUSk0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "l4ZLbswmz/SURzd7TmiFQBG2ot756f66SvEyjGhB5gY=" -> "KS68cukBZpYqo3jyP5xJoPBQvbjXb/lqanVN/CT0TII="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "BV6eJ5N9DPIOtHj0IGNVZ5wnHIgz6BtbQutXk3QQHDA=" -> "8kKf1rNYweP4LADeORcUhytjnYcQ8ITlphMLTtsId9c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "XlNudtpUO2ANlpexYgsawEdb24peb3PuTxPZeFexfxQ=" -> "f7BJGsi+ABPCTaA1Ncr+Y3L2vYJ0xJLh/D8pUnF9wmw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ap4vb8vtKABXGlXaCvos9+6aF4Y0bwlx6GMiotAlnuI=" -> "MUczVV/aZDbnWZfgWsFcbkaZ3g586bnP4+sGntvnmi8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "lQ4vQsa/Z9riK8+kwjlQ5wlQKQX+wkgnmei/pR39Ras=" -> "joFZt4nqD2VUDe/AQZdaZkAhooMo0Ao8X9kFD5a42LQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "TqmYBaIeaw1XdWFz2tpTr6aUOnDqUsBtHuPrueNM78s=" -> "VBvTimcnru2bgq44pGvWbluFeOyHIh/kZhha4hciVUg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZRhPGk+F/fSAeFgvfHEH4GAdIWuiCv5ZWVGmr84nV3M=" -> "Wbf9snugCw0iKUFwff457oJAT2iVLD5KaTnyrrTnZg4="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "oGxA5rUJLFHnKSOva0EiacX4XICxfzRY0HQj+IMrngY=" -> "uAd/r8eLjv1yqV4Y/88BaJ/clHWiYbrv96m/yWJ73/s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "nTitAOuuIK1XhKoD94fqmiCLm4FnJUr09nF+27COwcA=" -> "Ah3Vic4BeCY37xp+gfMvFR56bN+qyOVL598+3mYkC8o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "1/HAOaj/xcLBb2SSraE2CzTel2Y0R4RtBoObD7bjccU=" -> "X6XR1Q4D8QicTuAtGtFndR0QSR/KsIkz1K3miF6Xp8M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "ixujaE8MQs24m055usWEFRxmKt0dalbarJzQvINRKUs=" -> "HQq8KaxkdvZ5xLAroIoi2dxG5Uw7nCfEkXIibyslA5w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "ioIVFH1bwlMQd94GaN738KBelfu8eEBQQf1urA6vrYk=" -> "IHuUPDUi9bohMHPMw/5YUoPC89NiVvFMiC4mUBV0mxc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "/vfsy/tX7b1ESGGXs3OIj+JL7K/4fqhqhd2EB4ty3/4=" -> "CKy/zTA90PStNWiks3razapgjfxv4bx89qBh7B8sBGM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "9IdeemaMj5nISqZjKuq3rUrcFQNm4nzYzRXJrzrtON0=" -> "JDk/Ce9jwCFjONgmZ/vWfKuOF6l71X3HNSRNc1VxomM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-24T16:22:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "T5qyaHR//xxbDKOTFYJ+9zBduHrGltSvdZ8aOFU9/ms=" -> "zdKPQ9z33zg3gy+EV/HfAvnWbS9kOXHYBa9Woo9kkVY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-24T16:21:59Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "slsqe1" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-24T16:21:58Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-24T16:21:58Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*